someone42/hardware-bitcoin-wallet/lpc11uxx/statistics.c
/** Calculate the (cyclic) autocorrelation by using the power spectral density
  * estimate (#psd_accumulator).
  * \param fft_buffer The result of the autocorrelation computation will be
  *                   written here.
  * \return 0 if the calculation completed successfully, non-zero if there was
  *         some arithmetic error.
  */
static int calculateAutoCorrelation(ComplexFixed *fft_buffer)
{
	int r;
	fix16_t sample;
	uint32_t i;
	uint32_t fft_index;
	uint32_t psd_index;

	psd_index = 0;
	for (i = 0; i < (FFT_SIZE * 2); i++)
	{
		sample = psd_accumulator[psd_index];
		fft_index = i >> 1;
		if ((i & 1) == 0)
		{
			fft_buffer[fft_index].real = sample;
		}
		else
		{
			fft_buffer[fft_index].imag = sample;
		}
		if (i < FFT_SIZE)
		{
			psd_index++;
		}
		else
		{
			psd_index--;
		}
	}
	r = 0;
	if (fft(fft_buffer, 1))
	{
		r = 1;
	}
	if (fftPostProcessReal(fft_buffer, 1))
	{
		r = 1;
	}
	return r;
}

/** Find the magnitude of the largest autocorrelation amplitude.
  * Theoretically, for an infinitely large sample and a perfect noise source,
  * the autocorrelation amplitude should be 0 everywhere (except for lag = 0).
  * Thus the maximum magnitude quantifies how non-ideal the HWRNG is.
  * \param fft_buffer The correlogram, as calculated by
  *                   calculateAutoCorrelation(). This should have at
  *                   least #FFT_SIZE + 1 entries.
  */
static fix16_t calculateMaximumAutoCorrelation(ComplexFixed *fft_buffer)
{
	fix16_t max;
	fix16_t sample;
	uint32_t i;

	max = fix16_zero;
	for (i = AUTOCORR_START_LAG; i < (FFT_SIZE + 1); i++)
	{
		sample = fft_buffer[i].real;
		if (sample < fix16_zero)
		{
			sample = -sample;
		}
		if (sample > max)
		{
			max = sample;
		}
	}
	return max;
}

/** Run statistical tests on histogram and report any failures.
  * This only should be called once the histogram is full.
  * \param fft_buffer An array to use in FFT computations. This must have
  *                   enough space for #FFT_SIZE + 1 entries. The reason why
  *                   the caller must specify an array (instead of the more
  *                   usual case of the callee declaring another local
  *                   variable) is that the buffer is quite large. This
  *                   interface allows this function to re-use a FFT buffer.
  * \return 0 if all tests passed, non-zero if any tests failed.
  */
static int histogramTestsFailed(ComplexFixed *fft_buffer)
{
	int r;
	int moment_error;
	int autocorrelation_error;
	int entropy_error;
	fix16_t mean;
	fix16_t variance;
	fix16_t kappa3; // non-standardised skewness
	fix16_t kappa4; // non-standardised kurtosis
	fix16_t variance_squared;
	fix16_t three_times_variance_squared;
	fix16_t variance_cubed;
	fix16_t kappa3_squared;
	fix16_t term1;
	int bandwidth; // as FFT bin number
	int max_bin; // as FFT bin number
	fix16_t max_autocorrelation;
	fix16_t entropy_estimate;
#ifdef TEST_STATISTICS
	int i;
	int temp_r;
	char buffer[20];
#endif // #ifdef TEST_STATISTICS

	fix16_error_flag = 0;
	mean = calculateCentralMoment(fix16_zero, 1);
	variance = calculateCentralMoment(mean, 2);
	kappa3 = calculateCentralMoment(mean, 3);
	kappa4 = calculateCentralMoment(mean, 4);
	moment_error = fix16_error_flag;
	fix16_error_flag = 0;
	bandwidth = estimateBandwidth(&max_bin);
	fix16_error_flag = 0;
	autocorrelation_error = calculateAutoCorrelation(fft_buffer);
	max_autocorrelation = calculateMaximumAutoCorrelation(fft_buffer);
	fix16_error_flag = 0;
	entropy_estimate = estimateEntropy();
	entropy_error = fix16_error_flag;

#ifdef TEST_STATISTICS
	// Write moments to screen so that they may be inspected in real-time.
	// If reporting to stream is enabled, they are also written to the stream
	// so that the host may capture them into a comma-seperated variable file.
	displayOn();
	clearDisplay();
	if (report_to_stream == 3)
	{
		sprintFix16(buffer, fix16_from_int(max_bin));
		writeStringToDisplay(buffer);
		sendString(buffer);
		sendString(", ");
		nextLine();
		sprintFix16(buffer, fix16_from_int(bandwidth));
		writeStringToDisplay(buffer);
		sendString(buffer);
		nextLine();
	}
	else if (report_to_stream == 4)
	{
		for (i = 0; i < (FFT_SIZE + 1); i++)
		{
			sprintFix16(buffer, fix16_from_int(i));
			sendString(buffer);
			sendString(", ");
			sprintFix16(buffer, fft_buffer[i].real);
			sendString(buffer);
			sendString(", ");
			sprintFix16(buffer, fft_buffer[i].imag);
			sendString(buffer);
			sendString("\r\n");
		}
	}
	else if (report_to_stream == 5)
	{
		sprintFix16(buffer, variance);
		writeStringToDisplay(buffer);
		nextLine();
		sprintFix16(buffer, max_autocorrelation);
		writeStringToDisplay(buffer);
		sendString(buffer);
		sendString(", ");
		nextLine();
		sprintFix16(buffer, entropy_estimate);
		writeStringToDisplay(buffer);
		sendString(buffer);
		nextLine();
	}
	else
	{
		sprintFix16(buffer, mean);
		writeStringToDisplay(buffer);
		if (report_to_stream == 1)
		{
			sendString(buffer);
			sendString(", ");
		}
		nextLine();
		sprintFix16(buffer, variance);
		writeStringToDisplay(buffer);
		if (report_to_stream == 1)
		{
			sendString(buffer);
			sendString(", ");
		}
		nextLine();
		sprintFix16(buffer, kappa3);
		writeStringToDisplay(buffer);
		if (report_to_stream == 1)
		{
			sendString(buffer);
			sendString(", ");
		}
		nextLine();
		sprintFix16(buffer, kappa4);
		writeStringToDisplay(buffer);
		if (report_to_stream == 1)
		{
			sendString(buffer);
		}
		if (report_to_stream == 2)
		{
			for (i = 0; i < (FFT_SIZE + 1); i++)
			{
				sprintFix16(buffer, fix16_from_int(i));
				sendString(buffer);
				sendString(", ");
				sprintFix16(buffer, psd_accumulator[i]);
				sendString(buffer);
				sendString("\r\n");
			}
		}
	} // end if (report_to_stream == 3)
	
#endif // #ifdef TEST_STATISTICS

	r = 0;
	// STATTEST_MIN_MEAN and STATTEST_MAX_MEAN are in ADC output numbers.
	// To be comparable to mean, they need to be scaled and offset, just
	// as samples are in updateIteratorCache().
	if (mean <= F16((STATTEST_MIN_MEAN - (HISTOGRAM_NUM_BINS / 2)) / SAMPLE_SCALE_DOWN))
	{
		r |= 1; // mean below minimum
	}
	if (mean >= F16((STATTEST_MAX_MEAN - (HISTOGRAM_NUM_BINS / 2)) / SAMPLE_SCALE_DOWN)) 
	{
		r |= 1; // mean above maximum
	}
	if (variance <= F16((STATTEST_MIN_VARIANCE / SAMPLE_SCALE_DOWN) / SAMPLE_SCALE_DOWN))
	{
		r |= 2; // variance below minimum
	}
	if (variance >= F16((STATTEST_MAX_VARIANCE / SAMPLE_SCALE_DOWN) / SAMPLE_SCALE_DOWN))
	{
		r |= 2; // variance below minimum
	}
	// kappa3 is supposed to be standardised by dividing by
	// variance ^ (3/2), but this would involve one division and one square
	// root. But since skewness = kappa3 / variance ^ (3/2), this implies
	// that kappa3 ^ 2 = variance ^ 3 * skewness ^ 2.
	variance_squared = fix16_mul(variance, variance);
	variance_cubed = fix16_mul(variance_squared, variance);
	kappa3_squared = fix16_mul(kappa3, kappa3);
	// Thanks to the squaring of kappa3, only one test is needed.
	if (kappa3_squared >= fix16_mul(variance_cubed, F16(STATTEST_MAX_SKEWNESS * STATTEST_MAX_SKEWNESS)))
	{
		r |= 4; // skewness out of bounds
	}
	// kappa4 is supposed to be standardised by dividing by variance ^ 2, but
	// this would involve division. But since
	// kurtosis = kappa4 / variance ^ 2 - 3, this implies that
	// kappa_4 = kurtosis * variance ^ 2 + 3 * variance ^ 2.
	three_times_variance_squared = fix16_mul(fix16_from_int(3), variance_squared);
	term1 = fix16_mul(F16(STATTEST_MIN_KURTOSIS), variance_squared);
	if (kappa4 <= fix16_add(term1, three_times_variance_squared))
	{
		r |= 8; // kurtosis below minimum
	}
	term1 = fix16_mul(F16(STATTEST_MAX_KURTOSIS), variance_squared);
	if (kappa4 >= fix16_add(term1, three_times_variance_squared))
	{
		r |= 8; // kurtosis above maximum
	}
	if (moment_error || histogram_overflow)
	{
		r |= 15; // arithmetic error (probably overflow)
	}
	if (fix16_from_int(max_bin) < F16(PSD_MIN_PEAK * 2.0 * FFT_SIZE))
	{
		r |= 16; // peak in power spectrum is below minimum frequency
	}
	if (fix16_from_int(max_bin) > F16(PSD_MAX_PEAK * 2.0 * FFT_SIZE))
	{
		r |= 16; // peak in power spectrum is below minimum frequency
	}
	if (fix16_from_int(bandwidth) < F16(PSD_MIN_BANDWIDTH * 2.0 * FFT_SIZE))
	{
		r |= 32; // bandwidth of HWRNG below minimum
	}
	if (psd_accumulator_error)
	{
		r |= 48; // arithmetic error (probably overflow)
	}
	if (max_autocorrelation > fix16_mul(variance, F16(AUTOCORR_THRESHOLD)))
	{
		r |= 64; // maximum autocorrelation amplitude above maximum
	}
	if (autocorrelation_error)
	{
		r |= 64; // arithmetic error (probably overflow)
	}
	if (entropy_estimate < F16(STATTEST_MIN_ENTROPY))
	{
		r |= 128; // entropy per sample below minimum
	}
	if (entropy_error)
	{
		r |= 128; // arithmetic error (probably overflow)
	}

