someone42/hardware-bitcoin-wallet/lpc11uxx/statistics.c
#ifdef TEST_STATISTICS
	temp_r = r;
	writeStringToDisplay(" ");
	for (i = 0; i < 8; i++)
	{
		if ((temp_r & 1) == 0)
		{
			writeStringToDisplay("p");
			if (report_to_stream == 1)
			{
				sendString(", pass");
			}
		}
		else
		{
			writeStringToDisplay("F");
			if (report_to_stream == 1)
			{
				sendString(", fail");
			}
		}
		temp_r >>= 1;
	}
	if (report_to_stream != 0)
	{
		sendString("\r\n");
	}
#endif // #ifdef TEST_STATISTICS

	return r;
}

/** Fill buffer with 32 random bytes from a hardware random number generator.
  * \param buffer The buffer to fill. This should have enough space for 32
  *               bytes.
  * \return An estimate of the total number of bits (not bytes) of entropy in
  *         the buffer.
  */
int hardwareRandom32Bytes(uint8_t *buffer)
{
	uint32_t i;
	uint32_t sample;
	uint32_t index;
	fix16_t scaled_sample;
	fix16_t term1;
	fix16_t term2;
	fix16_t sum_of_squares;
	ComplexFixed fft_buffer[FFT_SIZE + 1];

	if (!is_not_first_in_histogram)
	{
		// This is the first sample in a series of SAMPLE_COUNT samples. Thus
		// everything needs to start from a blank state.
		clearHistogram();
		memset(psd_accumulator, 0, sizeof(psd_accumulator));
		psd_accumulator_error = 0;
		// The histogram is empty. The sample buffer is also assumed to be
		// empty, since this may be the first call to hardwareRandom32Bytes()
		// after power-on. Therefore an extra call to beginFillingADCBuffer()
		// needs to be done to ensure that a full, current sample buffer is
		// available.
		sample_buffer_consumed = 0;
		beginFillingADCBuffer();
		is_not_first_in_histogram = 1;
	}
	if (sample_buffer_consumed == 0)
	{
		// Need to wait until next sample buffer has been filled.
		while (!sample_buffer_full)
		{
			// do nothing
		}
	}
	// From here on, code can assume that a full, current sample buffer is
	// available.

	// The following loop assumes that #SAMPLE_BUFFER_SIZE is a multiple
	// of 16.
#if ((SAMPLE_BUFFER_SIZE & 15) != 0)
#error "SAMPLE_BUFFER_SIZE not a multiple of 16"
#endif // #if ((SAMPLE_BUFFER_SIZE & 15) != 0)
	for (i = 0; i < 16; i++)
	{
		sample = adc_sample_buffer[sample_buffer_consumed];
		incrementHistogram(sample);
		// Fill entropy buffer with ADC sample data.
		buffer[i * 2] = (uint8_t)sample;
		buffer[i * 2 + 1] = (uint8_t)(sample >> 8);
		sample_buffer_consumed++;
	}

	if (sample_buffer_consumed >= SAMPLE_BUFFER_SIZE)
	{
		// The code below which calculates a FFT and accumulates the result
		// assumes that SAMPLE_BUFFER_SIZE is FFT_SIZE * 2 (i.e. the sample
		// buffer is conveniently large enough to perform a double-sized real
		// FFT on).
#if SAMPLE_BUFFER_SIZE != (FFT_SIZE * 2)
#error "SAMPLE_BUFFER_SIZE not twice FFT_SIZE"
#endif // #if SAMPLE_BUFFER_SIZE != (FFT_SIZE * 2)
		// Fill FFT buffer with entire contents of ADC sample data.
		// Real/imaginary interleaving is done to allow a double-size real
		// FFT to be performed; see fftPostProcessReal() for more details.
		for (i = 0; i < SAMPLE_BUFFER_SIZE; i++)
		{
			index = i >> 1;
			scaled_sample = scaleSample((int)adc_sample_buffer[i]);
			if ((i & 1) == 0)
			{
				fft_buffer[index].real = scaled_sample;
			}
			else
			{
				fft_buffer[index].imag = scaled_sample;
			}
		}
		// Sample buffer fully consumed; need to get a new buffer.
		sample_buffer_consumed = 0;
		beginFillingADCBuffer();
		// Before computing the FFT, the mean of the FFT buffer is subtracted
		// out. This is because we're not interested in the DC component of
		// the FFT result (testing the sample mean is done elsewhere in this
		// file). Almost the same thing could be accomplished by ignoring
		// fft_buffer[0] in the PSD accumulation loop, but pre-subtraction
		// reduces the chance of overflow
		subtractMean(fft_buffer);
		if (fft(fft_buffer, 0))
		{
			psd_accumulator_error = 1;
		}
		if (fftPostProcessReal(fft_buffer, 0))
		{
			psd_accumulator_error = 1;
		}
		fix16_error_flag = 0;
		for (i = 0; i < (FFT_SIZE + 1); i++)
		{
			term1 = fix16_mul(fft_buffer[i].real, FIX16_RECIPROCAL_OF(8));
			term1 = fix16_mul(term1, term1);
			term2 = fix16_mul(fft_buffer[i].imag, FIX16_RECIPROCAL_OF(8));
			term2 = fix16_mul(term2, term2);
			sum_of_squares = fix16_add(term1, term2);
			// PSD is scaled down according to the number of samples. This
			// will normalise the result, since total power scales as the
			// number of samples.
			// Since FIX16_RECIPROCAL_OF expects an integer, SAMPLE_COUNT must
			// be >= 512.
#if SAMPLE_COUNT < 512
#error "SAMPLE_COUNT too small (it's < 512)"
#endif // #if SAMPLE_COUNT < 512
			sum_of_squares = fix16_mul(sum_of_squares, FIX16_RECIPROCAL_OF(SAMPLE_COUNT / 512));
			psd_accumulator[i] = fix16_add(psd_accumulator[i], sum_of_squares);
		}
		if (fix16_error_flag)
		{
			psd_accumulator_error = 1;
		}
	}

	if (samples_in_histogram >= SAMPLE_COUNT)
	{
		// Histogram is full. Statistical properties can now be calculated.
		is_not_first_in_histogram = 0;
		if (histogramTestsFailed(fft_buffer))
		{
			return -1; // statistical tests indicate HWRNG failure
		}
		// Why return 512 (bits)? This ensures that hardwareRandom32Bytes()
		// will be called a minimum number of times per getRandom256() call,
		// assuming an entropy safety factor of 2 in prandom.c.
		// This is extremely conservative, given any reasonable value of
		// SAMPLE_COUNT. For example, for a SAMPLE_COUNT of 4096, this
		// probably underestimates the usable entropy by a factor of about 50.
		return 512;
	}
	else
	{
		// Indicate to caller that more samples are needed in order to do
		// statistical tests.
		return 0;
	}
}

#ifdef TEST_STATISTICS

/** Quick and dirty conversion of fix16 to string.
  * \param buffer Character buffer where null-terminated will be written to.
  *               Must have space for 16 characters.
  * \param in Number to convert to string.
  */
static void sprintFix16(char *buffer, fix16_t in)
{
	int suppress_leading_zeroes;
	int i;
	int index;
	uint32_t int_part;
	uint32_t digit;
	char temp[5];

	// Check sign.
	index = 0;
	if (in < fix16_zero)
	{
		in = -in;
		buffer[index++] = '-';
	}

	// Convert integer part.
	int_part = ((uint32_t)in) >> 16;
	for (i = 0; i < 5; i++)
	{
		digit = int_part % 10;
		int_part = int_part / 10;
		temp[i] = (char)(digit + '0');
	}
	suppress_leading_zeroes = 1;
	for (i = 0; i < 5; i++)
	{
		if (!suppress_leading_zeroes || (temp[4 - i] != '0'))
		{
			buffer[index++] = temp[4 - i];
			suppress_leading_zeroes = 0;
		}
	}
	// If integer part is 0, include one leading zero.
	if (suppress_leading_zeroes)
	{
		buffer[index++] = '0';
	}
	buffer[index++] = '.';

	// Convert fractional part.
	in = (fix16_t)(((uint32_t)in) & 0xffff);
	for (i = 0; i < 7; i++)
	{
		in *= 10;
		digit = ((uint32_t)in) >> 16;
		buffer[index++] = (char)(digit + '0');
		in = (fix16_t)(((uint32_t)in) & 0xffff);
	}

	buffer[index++] = '\0';
}

